// 03.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	int a, b;
	double c, d;
	cout << "введите два целых числа через пробел\n";
	cin >> a >> b;
	cout << "\n" << a << " + " << b << " = " << a + b << "\n";
	cout << a << " - " << b << " = " << a - b << "\n";
	cout << a << " * " << b << " = " << a * b << "\n";
	cout << a << " / " << b << " = " << a / b << "\n";
	cout << "введите два вещественных числа\n";
	cin >> c >> d;
	cout << "\n" << c << " + " << d << " = " << c + d << "\n";
	cout << c << " - " << d << " = " << c - d << "\n";
	cout << c << " * " << d << " = " << c * d << "\n";
	cout << c << " / " << d << " = " << c / d << "\n";
	cout << "Введите целое и вещественное числа\n";
	cin >> a >> d;
	cout << "\n" << a << " + " << d << " = " << a + d << "\n";
	cout << a << " - " << d << " = " << a - d << "\n";
	cout << a << " * " << d << " = " << a * d << "\n";
	cout << a << " / " << d << " = " << a / d << "\n";
	cout << "при делении целоых чисел не нацело, результат округляется (в меньшую сторону), при делении целого числа на вещественное выводится с дробной частью";
}

